## Predicting Movie Ticket Price of Indian Movie Theatre

In [1]:
### Importing Libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('indian-movie-theatres.csv')

In [3]:
### Columns and Variables
df.shape

(578, 15)

There are 578 total data points and 15 variables

In [4]:
df.head()

,city,theatre_name,average_ticket_price,total_seats,no_screens,type,theatre_chain,lat,lon,calculated_seats,calculated_ticket_prices,calculated_screens,average_2,source_of_information,notes
0,Ahmedabad,"AB Miniplex: Shivranjini Cross Road, Satellite",125.619048,302,3,Multiplex,NaN,23.024940,72.529380,302.0,118.0,3.0,124.00,BookMyShow,NaN
1,Ahmedabad,Amber Cinema: Ahmedabad,100.833333,763,1,Single Screen,NaN,23.034310,72.620020,763.0,80.0,1.0,98.75,BookMyShow,NaN
2,Ahmedabad,Anupam Cinema: Ahmedabad,125.833333,781,1,Single Screen,NaN,23.006560,72.613330,781.0,80.0,1.0,121.25,BookMyShow,NaN
3,Ahmedabad,"Apsara Cinema, Behrampura",NaN,1117,1,Single Screen,NaN,23.003974,72.597468,NaN,NaN,NaN,NaN,MediaAnt,NaN
4,Ahmedabad,"Aradhana Cinema, Behrampura",NaN,455,1,Single Screen,NaN,23.003960,72.597520,NaN,NaN,NaN,NaN,MediaAnt,NaN

In [5]:
df.isnull().sum()

city                          0
theatre_name                  0
average_ticket_price        176
total_seats                   0
no_screens                    0
type                          0
theatre_chain               393
lat                           0
lon                           0
calculated_seats            176
calculated_ticket_prices    176
calculated_screens          176
average_2                   176
source_of_information         0
notes                       499
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 578 entries, 0 to 577
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   city                      578 non-null    object
 1   theatre_name              578 non-null    object
 2   average_ticket_price      402 non-null    float64
 3   total_seats               578 non-null    int64
 4   no_screens                578 non-null    int64
 5   type                      578 non-null    object
 6   theatre_chain             185 non-null    object
 7   lat                       578 non-null    float64
 8   lon                       578 non-null    float64
 9   calculated_seats          402 non-null    float64
 10  calculated_ticket_prices  402 non-null    float64
 11  calculated_screens        402 non-null    float64
 12  average_2                 402 non-null    float64
 13  source_of_information     578 non-null    object
 14  notes                     79 non-null     object
dtypes: float64(7), int64(2), object(6)
memory usage: 67.9+ KB

In [7]:
print("According to the data there are total 15 columns")
df_cat = df.select_dtypes(include=np.object)
df_num = df.select_dtypes(include=np.number)
print('Total categorical columns : ',len(df_cat.columns))
print('\n')
print('Categorical column names : ',df_cat.columns)
print('\n')
print('Total numerical columns : ',len(df_num.columns))
print('\n')
print('Numerical column names : ',df_num.columns)

According to the data there are total 15 columns
Total categorical columns :  6


Categorical column names :  Index(['city', 'theatre_name', 'type', 'theatre_chain',
       'source_of_information', 'notes'],
      dtype='object')


Total numerical columns :  9


Numerical column names :  Index(['average_ticket_price', 'total_seats', 'no_screens', 'lat', 'lon',
       'calculated_seats', 'calculated_ticket_prices', 'calculated_screens',
       'average_2'],
      dtype='object')

/var/folders/9l/vt6f2rxn5538q8_4lcq5wd9c0000gn/T/ipykernel_1792/1935576600.py:2: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df_cat = df.select_dtypes(include=np.object)

In [8]:
df.describe()

,average_ticket_price,total_seats,no_screens,lat,lon,calculated_seats,calculated_ticket_prices,calculated_screens,average_2
count,402.000000,578.000000,578.000000,578.000000,578.000000,402.000000,402.000000,402.000000,402.000000
mean,168.781990,815.219723,2.062284,17.783690,77.732424,620.074627,138.552751,2.422886,168.841672
std,131.559966,430.826349,1.813562,4.891071,4.067331,519.621409,84.063571,1.895071,130.433846
min,0.000000,0.000000,0.000000,9.914258,72.478560,32.000000,0.000000,1.000000,0.000000
25%,95.366667,528.500000,1.000000,13.011568,76.277899,208.250000,90.000000,1.000000,94.700000
50%,130.000000,800.000000,1.000000,17.434560,77.595295,444.000000,112.916667,1.000000,131.568182
75%,197.837121,1027.500000,3.000000,19.202565,78.515160,935.500000,157.805556,4.000000,199.100000
max,1458.333333,3175.000000,10.000000,28.734690,88.406360,3714.000000,685.000000,9.000000,1412.500000

In [9]:
## Dropping columns which are not important in the large data set and with many empty values
df = df.drop(['notes','theatre_chain'],axis=1)

Dropped Notes and Theatre_Chain

In [10]:
df.shape

(578, 13)

In [26]:
df.head()

,city,theatre_name,average_ticket_price,total_seats,no_screens,type,lat,lon,calculated_seats,calculated_ticket_prices,calculated_screens,average_2,source_of_information
0,Ahmedabad,"AB Miniplex: Shivranjini Cross Road, Satellite",125.619048,302,3,Multiplex,23.024940,72.529380,302.0,118.0,3.0,124.00,BookMyShow
1,Ahmedabad,Amber Cinema: Ahmedabad,100.833333,763,1,Single Screen,23.034310,72.620020,763.0,80.0,1.0,98.75,BookMyShow
2,Ahmedabad,Anupam Cinema: Ahmedabad,125.833333,781,1,Single Screen,23.006560,72.613330,781.0,80.0,1.0,121.25,BookMyShow
3,Ahmedabad,"Apsara Cinema, Behrampura",NaN,1117,1,Single Screen,23.003974,72.597468,NaN,NaN,NaN,NaN,MediaAnt
4,Ahmedabad,"Aradhana Cinema, Behrampura",NaN,455,1,Single Screen,23.003960,72.597520,NaN,NaN,NaN,NaN,MediaAnt

In [12]:
df['theatre_name'].nunique()

578

In [13]:
df['type'].nunique()

2

In [14]:
df['source_of_information'].nunique()

6

In [15]:
df['average_ticket_price'].nunique()

242

In [17]:
df['calculated_seats'].nunique()

336

In [18]:
df['calculated_ticket_prices'].nunique()

154

In [19]:
df['average_2'].nunique()

233

In [58]:
df.isnull().sum()

city                          0
theatre_name                  0
average_ticket_price        578
total_seats                   0
no_screens                    0
type                          0
lat                           0
lon                           0
calculated_seats            578
calculated_ticket_prices    578
calculated_screens          578
average_2                   578
source_of_information         0
dtype: int64

### There seems to be many unique values for average ticket price, calculated seats, calculated ticket prices and average 2

In order to fill the missing values for avergae ticket price, calculated seats, calculated ticket prices, average_2. We will use the median values.

#### Convert all empty values to NaN Values

In [31]:
# Change all the empty values to NaN Values in average ticket price
df['average_ticket_price'] = pd.to_numeric(df['average_ticket_price'],errors='coerce')

In [33]:
# Change all the empty valyes to NaN Values in calculated seats
df['calculated_seats'] = pd.to_numeric(df['calculated_seats'],errors='coerce')

In [35]:
# Change all the empty values to NaN Values in Calculated Ticket Prices
df['calculated_ticket_prices'] = pd.to_numeric(df['calculated_ticket_prices'],errors='coerce')

In [37]:
# Change all the empty values to NaN Values in Calculated Screens
df['calculated_screens'] = pd.to_numeric(df['calculated_screens'],errors='coerce')

In [40]:
# Change all the empty values to NaN values in average_2
df['average_2'] = pd.to_numeric(df['average_2'],errors='coerce')

In [57]:
df.isnull().sum()

city                          0
theatre_name                  0
average_ticket_price        578
total_seats                   0
no_screens                    0
type                          0
lat                           0
lon                           0
calculated_seats            578
calculated_ticket_prices    578
calculated_screens          578
average_2                   578
source_of_information         0
dtype: int64

#### Fill all empty values with median

In [53]:
df['average_ticket_price'] = df['average_ticket_price'].fillna(df['average_ticket_price'].median(),inplace=True)

In [44]:
df['calculated_seats'] = df['calculated_seats'].fillna(df['calculated_seats'].median(),inplace=True)

In [45]:
df['calculated_ticket_prices'] = df['calculated_ticket_prices'].fillna(df['calculated_ticket_prices'].median(),inplace=True)

In [46]:
df['calculated_screens'] = df['calculated_screens'].fillna(df['calculated_screens'].median(),inplace=True)

In [47]:
df['average_2'] = df['average_2'].fillna(df['average_2'].median(),inplace=True)

#### Change Data Type to Integer

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 578 entries, 0 to 577
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   city                      578 non-null    object
 1   theatre_name              578 non-null    object
 2   average_ticket_price      0 non-null      object
 3   total_seats               578 non-null    int64
 4   no_screens                578 non-null    int64
 5   type                      578 non-null    object
 6   lat                       578 non-null    float64
 7   lon                       578 non-null    float64
 8   calculated_seats          0 non-null      object
 9   calculated_ticket_prices  0 non-null      object
 10  calculated_screens        0 non-null      object
 11  average_2                 0 non-null      object
 12  source_of_information     578 non-null    object
dtypes: float64(2), int64(2), object(9)
memory usage: 58.8+ KB

In [54]:
df = df.convert_dtypes()

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 578 entries, 0 to 577
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   city                      578 non-null    string
 1   theatre_name              578 non-null    string
 2   average_ticket_price      0 non-null      object
 3   total_seats               578 non-null    Int64
 4   no_screens                578 non-null    Int64
 5   type                      578 non-null    string
 6   lat                       578 non-null    Float64
 7   lon                       578 non-null    Float64
 8   calculated_seats          0 non-null      object
 9   calculated_ticket_prices  0 non-null      object
 10  calculated_screens        0 non-null      object
 11  average_2                 0 non-null      object
 12  source_of_information     578 non-null    string
dtypes: Float64(2), Int64(2), object(5), string(4)
memory usage: 61.1+ KB

In [56]:
df.isnull().sum()

city                          0
theatre_name                  0
average_ticket_price        578
total_seats                   0
no_screens                    0
type                          0
lat                           0
lon                           0
calculated_seats            578
calculated_ticket_prices    578
calculated_screens          578
average_2                   578
source_of_information         0
dtype: int64